app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-08-21 17:19:49.827415"], ["id", 1]]
---
  def update
    @school_class.update(school_class_params(:title, :room_number))